##  Clase practica NÂ° 4
intro a la manipulacion de datos con pandas

### 1)

descargar el archivo "ko_comas.csv" que se encuentra en el campus del curso e importarlo localmente en la variable "df". Imprimer el head del Dataframe con los primeros 12 valores para corroborar.

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("./../archivos/ko_comas.csv") #ruta relativa (al archivo jupyter)

In [ ]:
df_2 = pd.read_csv(r"C:\Users\desarrollo\Desktop\ucema 2023\clase 4\archivos\ko_comas.csv") # ruta absoluta

In [ ]:
df.head(12)

          Date       Open       High        Low      Close    Volume
0   2000-01-03  15.777298  15.777298  15.029236  15.335261  10997000
1   2000-01-04  15.335263  15.454273  15.131246  15.352264   7308000
2   2000-01-05  15.352260  15.624282  15.250251  15.488271   9457400
3   2000-01-06  15.488283  15.692300  15.386274  15.505284   7129200
4   2000-01-07  15.743301  16.525366  15.743301  16.525366  11474000
5   2000-01-10  16.525359  16.576363  15.981314  15.998316   8723800
6   2000-01-11  16.355347  16.661372  16.355347  16.542362   9398000
7   2000-01-12  16.542366  16.814389  16.440358  16.729382   8389800
8   2000-01-13  16.712373  16.712373  16.440351  16.474354   6106000
9   2000-01-14  16.508366  16.848394  16.508366  16.610374   7513200
10  2000-01-18  16.610373  17.681461  16.610373  17.681461  18350800
11  2000-01-19  17.681470  17.749475  17.426449  17.749475  12813400

### 2)

con el fin de trabajar mas comodo en proximos ejercicios, se requiere pasar todos los nombres de las columnas (tambien llamadas  "features") a minusculas. Imprimir el head para corroborar.

In [ ]:
df.columns = [i.lower() for i in df.columns]

In [ ]:
df.head()

         date       open       high        low      close    volume
0  2000-01-03  15.777298  15.777298  15.029236  15.335261  10997000
1  2000-01-04  15.335263  15.454273  15.131246  15.352264   7308000
2  2000-01-05  15.352260  15.624282  15.250251  15.488271   9457400
3  2000-01-06  15.488283  15.692300  15.386274  15.505284   7129200
4  2000-01-07  15.743301  16.525366  15.743301  16.525366  11474000

### 3)

revisar cuales son los tipos de datos de cada feature. En caso de ser necesario, cambiar el tipo de dato para aprovechar  las caracteristicas de los DataFrames.

In [ ]:
#pd.to_datetime() es otra opcion para castear la fecha

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5642 entries, 0 to 5641
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    5642 non-null   object
 1   open    5642 non-null   float64
 2   high    5642 non-null   float64
 3   low     5642 non-null   float64
 4   close   5642 non-null   float64
 5   volume  5642 non-null   int64
dtypes: float64(4), int64(1), object(1)
memory usage: 264.6+ KB

In [ ]:
df["date"] = df["date"].astype("datetime64")

### 4)

* cambiar el nombre de la columna "date" por "fecha" y luego setearlo como indice.

In [ ]:
df.rename(columns={"date" : "fecha"} , inplace=True)

In [ ]:
df

                 open       high        low      close    volume
fecha
2000-01-03  15.777298  15.777298  15.029236  15.335261  10997000
2000-01-04  15.335263  15.454273  15.131246  15.352264   7308000
2000-01-05  15.352260  15.624282  15.250251  15.488271   9457400
2000-01-06  15.488283  15.692300  15.386274  15.505284   7129200
2000-01-07  15.743301  16.525366  15.743301  16.525366  11474000
...               ...        ...        ...        ...       ...
2022-05-27  64.260002  64.830002  64.139999  64.680000  17709000
2022-05-31  64.080002  64.320000  63.049999  63.380001  43159000
2022-06-01  63.419998  63.680000  62.130001  63.070000  15408300
2022-06-02  63.180000  63.740002  62.110001  63.730000  14586000
2022-06-03  63.570000  63.625000  62.820000  62.970001  13538112

[5642 rows x 5 columns]

In [ ]:
df.set_index("fecha" , inplace=True)

KeyError: "None of ['fecha'] are in the columns"

In [ ]:
df

                 open       high        low      close    volume
fecha
2000-01-03  15.777298  15.777298  15.029236  15.335261  10997000
2000-01-04  15.335263  15.454273  15.131246  15.352264   7308000
2000-01-05  15.352260  15.624282  15.250251  15.488271   9457400
2000-01-06  15.488283  15.692300  15.386274  15.505284   7129200
2000-01-07  15.743301  16.525366  15.743301  16.525366  11474000
...               ...        ...        ...        ...       ...
2022-05-27  64.260002  64.830002  64.139999  64.680000  17709000
2022-05-31  64.080002  64.320000  63.049999  63.380001  43159000
2022-06-01  63.419998  63.680000  62.130001  63.070000  15408300
2022-06-02  63.180000  63.740002  62.110001  63.730000  14586000
2022-06-03  63.570000  63.625000  62.820000  62.970001  13538112

[5642 rows x 5 columns]

### 5)
* guardar en la variable "apertura_1" la serie de datos que compone la columna "open". acceder mediante el atributo correspondiente.
* guardar en la variable "cierre_1" la serie de datos  que compone la columna "close". Acceder mediante el nombre de la columna.

para finalizar crear un dataframe llamado "data_1" con los datos de "apertura_1" y "cierre_1". Que ocurre con el index?

In [ ]:
apertura_1 = df.open # me guardo la serie entera.
cierre_1  = df["close"]

In [ ]:
datos = {"apertura" : apertura_1,
        "cierre" : cierre_1}
data_1 = pd.DataFrame(datos)
data_1

             apertura     cierre
fecha
2000-01-03  15.777298  15.335261
2000-01-04  15.335263  15.352264
2000-01-05  15.352260  15.488271
2000-01-06  15.488283  15.505284
2000-01-07  15.743301  16.525366
...               ...        ...
2022-05-27  64.260002  64.680000
2022-05-31  64.080002  63.380001
2022-06-01  63.419998  63.070000
2022-06-02  63.180000  63.730000
2022-06-03  63.570000  62.970001

[5642 rows x 2 columns]

### 6)

* guardar en la variable "apertura_2" UNICAMENTE los __VALORES__ de la columna "open". acceder mediante el atributo correspondiente.
* guardar en la variable "cierre_2" UNICAMENTE los __VALORES__ de la columna "close". Acceder mediante el nombre de la columna.

para finalizar crear un dataframe llamado "data_2" con los datos de apertura y cierre. Que ocurrio ahora con el index?

In [ ]:
apertura_2 = df.open.values #me guardo solo los valores.
cierre_2 = df["close"].values

In [ ]:
data_2 = pd.DataFrame()

In [ ]:
data_2["apertura"] = apertura_2
data_2["cierre"] = cierre_2
data_2

       apertura     cierre
0     15.777298  15.335261
1     15.335263  15.352264
2     15.352260  15.488271
3     15.488283  15.505284
4     15.743301  16.525366
...         ...        ...
5637  64.260002  64.680000
5638  64.080002  63.380001
5639  63.419998  63.070000
5640  63.180000  63.730000
5641  63.570000  62.970001

[5642 rows x 2 columns]

In [ ]:
print(type(apertura_1) , type(apertura_2))

<class 'pandas.core.series.Series'> <class 'numpy.ndarray'>

### 7)

* Descargar el archivo "ko_excel.xlsx" que se encuentra en el campus del curso e importarlo localmente en la variable "excel".
* Imprimer los ultimos 10 valores para ver de que trata el Dataframe.
* Solucionar los problemas para dejar el DataFrame listo para su analisis.

In [ ]:
excel = pd.read_excel("./../archivos/ko_excel.xlsx" , sheet_name=1 , skiprows=1 , header=1 , usecols=[2,3,4,5,6,7] )

In [ ]:
excel.tail() # como head , pero del final

           Date       Open       High        Low      Close    Volume
5637 2022-05-27  64.260002  64.830002  64.139999  64.680000  17709000
5638 2022-05-31  64.080002  64.320000  63.049999  63.380001  43159000
5639 2022-06-01  63.419998  63.680000  62.130001  63.070000  15408300
5640 2022-06-02  63.180000  63.740002  62.110001  63.730000  14586000
5641 2022-06-03  63.570000  63.625000  62.820000  62.970001  13538112

### 8)
Utilizando el dataframe "excel" imprimir:

* tipo de datos por columnas
* verificar si existen datos faltantes
* cuantas filas y columnas tiene el DataFrame?
* pasar nombres a minusculas
* cambiar "date" por "fecha" y luego setear esta columna como index.

In [ ]:
excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5642 entries, 0 to 5641
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    5642 non-null   datetime64[ns]
 1   Open    5642 non-null   float64
 2   High    5642 non-null   float64
 3   Low     5642 non-null   float64
 4   Close   5642 non-null   float64
 5   Volume  5642 non-null   int64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 264.6 KB

In [ ]:
excel.columns = [i.lower() for i in excel.columns]

In [ ]:
excel.rename(columns={"date" : "fecha"} , inplace=True)

In [ ]:
excel.set_index("fecha" , inplace=True)

In [ ]:
excel

                 open       high        low      close    volume
fecha
2000-01-03  15.777298  15.777298  15.029236  15.335261  10997000
2000-01-04  15.335263  15.454273  15.131246  15.352264   7308000
2000-01-05  15.352260  15.624282  15.250251  15.488271   9457400
2000-01-06  15.488283  15.692300  15.386274  15.505284   7129200
2000-01-07  15.743301  16.525366  15.743301  16.525366  11474000
...               ...        ...        ...        ...       ...
2022-05-27  64.260002  64.830002  64.139999  64.680000  17709000
2022-05-31  64.080002  64.320000  63.049999  63.380001  43159000
2022-06-01  63.419998  63.680000  62.130001  63.070000  15408300
2022-06-02  63.180000  63.740002  62.110001  63.730000  14586000
2022-06-03  63.570000  63.625000  62.820000  62.970001  13538112

[5642 rows x 5 columns]

### 9)

agregar tres columnas nuevas al Dataframe "excel". Una con el numero del dia , otra del mes y por ultimo del aÃ±o.

(hay una cuarta opcion que es el nombre del dia (str), que puede aportar info para usar mas adelante!!)

In [ ]:
excel["dia"] = excel.index.day
excel["mes"] = excel.index.month
excel["year"] = excel.index.year
excel["nombre_del_dia"] = excel.index.day_name()

In [ ]:
excel

,open,high,low,close,volume,dia,mes,year,nombre_del_dia
fecha,,,,,,,,,
2000-01-03,15.777298,15.777298,15.029236,15.335261,10997000,3,1,2000,Monday
2000-01-04,15.335263,15.454273,15.131246,15.352264,7308000,4,1,2000,Tuesday
2000-01-05,15.352260,15.624282,15.250251,15.488271,9457400,5,1,2000,Wednesday
2000-01-06,15.488283,15.692300,15.386274,15.505284,7129200,6,1,2000,Thursday
2000-01-07,15.743301,16.525366,15.743301,16.525366,11474000,7,1,2000,Friday
...,...,...,...,...,...,...,...,...,...
2022-05-27,64.260002,64.830002,64.139999,64.680000,17709000,27,5,2022,Friday
2022-05-31,64.080002,64.320000,63.049999,63.380001,43159000,31,5,2022,Tuesday
2022-06-01,63.419998,63.680000,62.130001,63.070000,15408300,1,6,2022,Wednesday
2022-06-02,63.180000,63.740002,62.110001,63.730000,14586000,2,6,2022,Thursday
2022-06-03,63.570000,63.625000,62.820000,62.970001,13538112,3,6,2022,Friday

### 10)

* Crear un "data_10" con las 100 lineas mas recientes.
* Ordenarlas de forma descendente.
* Cual fue el precio de apertura de la fila mas antigua?
* Que dia (day_name) fue la anteultima observacion?

In [ ]:
#loc es por etiqueta                    e            iloc es por posicion

data_10 = excel.copy() #este metodo copia el dataframe "excel" de forma correcta.
data_10 = data_10[-100:] #opcion 1
data_10.sort_index(ascending=False , inplace=True)

In [ ]:
#precio de apertura
data_10.iloc[-1].open

59.9709351699788

In [ ]:
#nomre del dia de la anteultima
data_10.iloc[-2].nombre_del_dia

'Wednesday'

In [ ]:
#data_10_b = excel.sort_index(ascending=False)
#data_10_b.iloc[ : 100].sort_index(ascending=True) #opcion 2

### 11)

* crear un "data_11" que contenga solo las observaciones (filas) hasta 2005 inclusive.
* Cual fue el volumen promedio de este subconjunto?
* cual fue el precio de cierre mas alto? que fecha fue?

In [ ]:
data_11 = excel.copy()
mascara = data_11["year"] <= 2005 #genera una serie de valores booleanos en base a la condicion
data_11 = data_11.loc[mascara]
#data_11 = data_11.loc[data_11["year"] <= 2005] misma logica, de otra forma
data_11

,open,high,low,close,volume,dia,mes,year,nombre_del_dia
fecha,,,,,,,,,
2000-01-03,15.777298,15.777298,15.029236,15.335261,10997000,3,1,2000,Monday
2000-01-04,15.335263,15.454273,15.131246,15.352264,7308000,4,1,2000,Tuesday
2000-01-05,15.352260,15.624282,15.250251,15.488271,9457400,5,1,2000,Wednesday
2000-01-06,15.488283,15.692300,15.386274,15.505284,7129200,6,1,2000,Thursday
2000-01-07,15.743301,16.525366,15.743301,16.525366,11474000,7,1,2000,Friday
...,...,...,...,...,...,...,...,...,...
2005-12-23,12.540995,12.562297,12.510564,12.522737,5063200,23,12,2005,Friday
2005-12-27,12.507518,12.583598,12.367532,12.467957,14248000,27,12,2005,Tuesday
2005-12-28,12.470997,12.522732,12.394918,12.410133,9763000,28,12,2005,Wednesday
2005-12-29,12.376659,12.446654,12.300580,12.355357,11163400,29,12,2005,Thursday
2005-12-30,12.288411,12.376663,12.267109,12.267109,11743200,30,12,2005,Friday

In [ ]:
sum(data_11.volume) / data_11.shape[0]

10734087.798408488

In [ ]:
#data_11.volume.mean() volumen de forma ams optima

In [ ]:
data_11.close.idxmax() , data_11.close.max() # forma casera

(Timestamp('2000-01-21 00:00:00'), 18.1915111541748)

In [ ]:
indice = data_11.close.idxmax()
precio_maximo = data_11.loc[indice]
indice , precio_maximo.close

(Timestamp('2000-01-21 00:00:00'), 18.1915111541748)

### 12)

* Crear un "data_12" que contenga solo observaciones entre 2007 y 2009 inclusive, y que solo cuente con las features "open" y "close".

* agregar una columna "var_nom" con la variacion nominal del precio durante el dia.

In [ ]:
data_12 = excel.copy()
mascara = (data_12.year >= 2007) & (data_12.year <=2009)
data_12 = data_12.loc[mascara]
data_12["var_nom"] = data_12.high - data_12["low"]
data_12

,open,high,low,close,volume,dia,mes,year,nombre_del_dia,var_nom
fecha,,,,,,,,,,
2007-01-03,15.135795,15.298546,15.110756,15.204652,15753400,3,1,2007,Wednesday,0.187790
2007-01-04,15.154570,15.242206,15.101364,15.210907,11810400,4,1,2007,Thursday,0.140842
2007-01-05,15.179614,15.201523,15.076330,15.104498,11607000,5,1,2007,Friday,0.125193
2007-01-08,15.026257,15.232825,15.026257,15.201528,17551000,8,1,2007,Monday,0.206568
2007-01-09,15.192135,15.282900,15.167096,15.214044,13724000,9,1,2007,Tuesday,0.115804
...,...,...,...,...,...,...,...,...,...,...
2009-12-24,19.650722,19.657557,19.500325,19.633631,5814200,24,12,2009,Thursday,0.157233
2009-12-28,19.623377,19.681485,19.578941,19.633631,7679600,28,12,2009,Monday,0.102544
2009-12-29,19.637050,19.814792,19.637050,19.736176,9551000,29,12,2009,Tuesday,0.177742
2009-12-30,19.736181,19.790870,19.647309,19.715672,9625200,30,12,2009,Wednesday,0.143561
2009-12-31,19.681489,19.739597,19.459312,19.483238,10848800,31,12,2009,Thursday,0.280285

###  13)

* crear un "data_13" que contenga rueda por medio y solo la primer columna.

* Que tipo de dato es "data_13" ?

In [ ]:
data_13 = excel.copy()
data_13 = data_13.iloc[ : :2 , [0]] # si pongo el 0 sin corchetes me devuelve una pd.Serie y no un pd.DataFrame.
data_13

                 open
fecha
2000-01-03  15.777298
2000-01-05  15.352260
2000-01-07  15.743301
2000-01-11  16.355347
2000-01-13  16.712373
...               ...
2022-05-20  60.490002
2022-05-24  62.880001
2022-05-26  64.070000
2022-05-31  64.080002
2022-06-02  63.180000

[2821 rows x 1 columns]

###  14)

* Crear "data_14" con aquellos datos que correspondan a los dias viernes ("Friday").

* imprimir "data_14" con un step de 4 en las filas y solo la columna "high".

###  15)

crear un "data_15" donde solo se contemplen los dias impares del mes.

# tarea ver como validamos si ingresan un float
###  16)  

pedir al usuario por consola 3 numeros del 1 al 12, validando que estos no se repitan.

Luego Utilizar estos numeros para filtrar los meses del dataframe que queremos visualizar.

guardar el subconjunto en "data_16"

In [ ]:
excel.head()

,open,high,low,close,volume,dia,mes,year,nombre_del_dia
fecha,,,,,,,,,
2000-01-03,15.777298,15.777298,15.029236,15.335261,10997000,3,1,2000,Monday
2000-01-04,15.335263,15.454273,15.131246,15.352264,7308000,4,1,2000,Tuesday
2000-01-05,15.352260,15.624282,15.250251,15.488271,9457400,5,1,2000,Wednesday
2000-01-06,15.488283,15.692300,15.386274,15.505284,7129200,6,1,2000,Thursday
2000-01-07,15.743301,16.525366,15.743301,16.525366,11474000,7,1,2000,Friday

In [ ]:
#ejercicion con validacion
lista = []
while (len(lista) < 3):
    numero = input("escribe un numero del mes: ")
    numero = int(numero)
    if isinstance(numero , int):
        if numero not in lista :
            lista.append(numero)
        else:
            print("che ese numero ya esta en la lista, proba de nuevo")
    else:
        print("che no es un entero")

escribe un numero del mes: 2.5

ValueError: invalid literal for int() with base 10: '2.5'

In [ ]:
pd.merge()
pd.

In [ ]:
#ejercicio sin validacion de que no se repitan
lista = []
for i in range(3):
    numero = int(input("escribe un numero del mes: "))
    lista.append(numero)

data_16 = excel.copy()
mascara = (data_16["mes"] == lista[0]) | (data_16["mes"] == lista[1]) | (data_16["mes"] == lista[2]) #version larga
mascara_2 = data_16["mes"].isin(lista) #version corta y eficiente
data_16 = data_16.loc[mascara_2]
data_16

escribe un numero del mes: 2
escribe un numero del mes: 2
escribe un numero del mes: 4

,open,high,low,close,volume,dia,mes,year,nombre_del_dia
fecha,,,,,,,,,
2000-02-01,15.624287,15.879308,15.318262,15.811302,8114600,1,2,2000,Tuesday
2000-02-02,15.743295,15.743295,15.250254,15.335261,7164000,2,2,2000,Wednesday
2000-02-03,15.335265,15.437273,14.978235,15.029240,9464400,3,2,2000,Thursday
2000-02-04,15.029240,15.709297,14.978236,15.301263,11501800,4,2,2000,Friday
2000-02-07,15.301268,15.675299,15.114252,15.471282,7742800,7,2,2000,Monday
...,...,...,...,...,...,...,...,...,...
2022-04-25,67.000000,67.199997,64.779999,65.940002,25082000,25,4,2022,Monday
2022-04-26,65.519997,66.370003,65.040001,65.050003,21982600,26,4,2022,Tuesday
2022-04-27,65.000000,66.279999,65.000000,65.559998,16971000,27,4,2022,Wednesday
2022-04-28,64.660004,66.279999,64.500000,66.190002,22010600,28,4,2022,Thursday
2022-04-29,65.870003,66.029999,64.489998,64.610001,20135300,29,4,2022,Friday

###  17)

* descargar las cotizaciones de AMZN del 1ro de enero de 2011 hasta la fecha.
* la cantidad de ruedas que hubo en el aÃ±o 2012.
* acceder a los datos de las ruedas 8 y 26 del aÃ±o 2021.
* pedir por consola el numero de rueda que deseamos buscar en el aÃ±o 2021 e imprimir los datos.

###  18)

Leer el archivo de precios de AAPL y devolver el dataFrame que tenga:

- Solo las columnas Open y Close
- Que tenga como indice el timestamp
- Que este ordenado por fechas
- que devuelva solo los ultimos 10 valores

In [ ]:
url = "https://docs.google.com/spreadsheets/d/e/2PACX-1vRraxkyU12H2gHzFTwbhMRKvSCZBVeKfFEc2MGZw5fNJz4b2s6EQJGu0Ek-GKrBdg/pub?output=xlsx"

###  19)

volver a cargar el archivo de AAPL
* Crear una nueva columna con el color de la vela diaria
* Verde si Close > Open
* Rojo si Close < Open
* Doji, si Close = Open

# consultar con chat gpt algunas opciones

###  20)

Usando el ejercicio 19, calcular el % de las ruedas con velas rojas del top 150 de mayor volumen historico

Calcular luego el % de Verdes, Rojas y Dojis de todo el historico